Revit 2024 API
RebarShapeVertex.GetConstraints Method
 Retrieve the list of constraints associated with this vertex.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IList<RebarShapeConstraint> GetConstraints()
Visual Basic
Public Function GetConstraints As IList(Of RebarShapeConstraint)
Visual C++
public:
IList<RebarShapeConstraint^>^ GetConstraints()
Return Value
 The list of constraints.
See Also
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace